In [2]:
# importing pandas library

import pandas as pd 
df = pd.DataFrame({"S_No":[1,2,3,4,5], "Name":['Shikhar', 'Anjan', 'falam', 'Satish', 'Raj']})
df

#copying the data to a csv
df.to_csv('dataframe2.csv')

In [4]:
# importing the datasource
df = pd.read_csv('dataframe.csv')
df

   Unnamed: 0  So_No     name
0           0      1   Srikar
1           1      2    falam
2           2      3    Anjan
3           3      4  Sathish
4           4      5      Raj

In [5]:
df2 = pd.read_csv('dataframe2.csv')
df2

   Unnamed: 0  S_No     Name
0           0     1  Shikhar
1           1     2    Anjan
2           2     3    falam
3           3     4   Satish
4           4     5      Raj

In [6]:
# creating another data frame


df3 = pd.DataFrame({"Name": ["Braund, Mr. Owen Harris","Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
                         "Age": [22, 35, 58],
                         "Sex": ["male", "male", "female"]})
df3

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [11]:
# accessing the data

df3['Age'],df3['Sex']

(0    22
 1    35
 2    58
 Name: Age, dtype: int64, 0      male
 1      male
 2    female
 Name: Sex, dtype: object)

In [14]:
# selecting data based on index
df3[:-1]

                       Name  Age   Sex
0   Braund, Mr. Owen Harris   22  male
1  Allen, Mr. William Henry   35  male

In [19]:
# if you want to see multiple column use [[]]
df3[['Age', 'Sex']]

   Age     Sex
0   22    male
1   35    male
2   58  female

In [25]:
# use iloc function if you would like to slicing 

df3.iloc[:,1:-1]

   Age
0   22
1   35
2   58

In [26]:
df3.dtypes

Name    object
Age      int64
Sex     object
dtype: object

In [28]:
ages = pd.Series([22,35,58], name = 'Age')
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [30]:
df3['Age'].max()

58

In [31]:
ages.max()

58

In [32]:
df3

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [33]:
df3.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [34]:
df3.head()

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [35]:
# default tail and head values are 5 
df3.tail()

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [36]:
df3.tail (2)

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female